/// week09-5.cpp 想要更了解大到小排序
#include <stdio.h>

int main()
{
    /// 陣列有10個數字
    int a[10] = {11, 22, 33, 44, 55, 66, 77, 88, 99, 97};

    // 1. 排序前：印出原始陣列
    for (int i=0; i<10; i++) printf("%d ", a[i]); /// 擠一行
    printf("\n"); /// 跳行

    // 2. 核心邏輯：執行「一輪」的兩兩比較
    // 注意：這裡只用了一個 for 迴圈，所以只會掃描一遍
    for (int i=0; i<10-1; i++) { /// 小心，i < 10-1 的「-1」
        if ( a[i] < a[i+1] ) {   /// 希望左大、右小，但現在「左小右大」
            int temp = a[i];    /// 就交換
            a[i] = a[i+1];
            a[i+1] = temp;
        }
    }

    // 3. 排序後：再把陣列印一次
    /// 會發現最小的 11 被移動到了最右邊
    for (int i=0; i<10; i++) printf("%d ", a[i]); /// 擠一行
    printf("\n"); /// 跳行

    return 0;
}
