/// week09-6.cpp 重複 week09-5 做很多次
#include <stdio.h>

int main()
{
    /// 陣列有10個數字
    int a[10] = {11, 22, 33, 44, 55, 66, 77, 88, 97, 99};

    // 1. 排序前：印出原始陣列
    for (int i=0; i<10; i++) printf("%d ", a[i]); /// 擠一行
    printf("\n"); /// 跳行

    // 2. 完整排序邏輯
    for (int k=0; k < 10-1; k++) { /// 只加這一行，重複執行排序掃描
        for (int i=0; i < 10-1; i++) { /// 小心，i < 10-1 的「-1」
            if ( a[i] < a[i+1] ) { /// 希望左大、右小，但現在「左小右大」反過來
                int temp = a[i]; /// 就交換
                a[i] = a[i+1];
                a[i+1] = temp;
            }
        }

        // 3. 每次執行完一輪外層迴圈，就把陣列印一次觀察變化
        for (int i=0; i<10; i++) printf("%d ", a[i]); /// 擠一行
        printf("\n"); /// 跳行
    } /// 只加這一行

    return 0;
}
